99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_wps/esp32_mquickjs_wifi_wps.c
#include "esp32_mquickjs_wifi_wps.h"
#include "esp32_mquickjs_memory.h"
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
#include "esp32_mquickjs_wifi_wps_session.h"
#include "esp32_mquickjs_wifi_wps_ap.h"
#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_event_queue.h"
#include "esp32_mquickjs_options.h"
#include "esp32_mquickjs_wireless_core.h"
#include "esp_heap_caps.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include <stdio.h>
#include <string.h>

typedef enum { WPS_RECEIVE, WPS_CLOSE } wps_operation_t;
typedef struct {
    esp_wps_config_t config;
    uint32_t timeout_ms;
    bool allow_ap_channel_change;
} wps_options_t;
struct esp32_mquickjs_future_driver_state {
    esp32_mquickjs_wifi_wps_session_t *session;
    wps_operation_t operation;
    uint32_t timeout_ms;
    int64_t deadline_us;
    bool started, cancelled, wait_timed_out, observation_registered;
};
#define SET(object, name, value) do { if (!esp32_mquickjs_set_property_ref(ctx, object, name, value)) goto fail; } while (0)

/* Copies exactly one validated UTF-8 string. No JS allocation occurs while the
 * temporary C-string pointer is live; diagnostics never contain its contents. */
static bool wps_string(JSContext *ctx, JSValue value, char *out, size_t capacity)
{
    if (!JS_IsString(ctx, value)) return false;
    JSCStringBuf buffer;
    size_t length = 0;
    const char *text = JS_ToCStringLen(ctx, &length, value, &buffer);
    if (!text || length >= capacity || memchr(text, 0, length)) return false;
    memcpy(out, text, length); out[length] = 0;
    return true;
}

static bool wps_options_for_role(JSContext *ctx, JSGCRef *root, wps_options_t *options, bool registrar)
{
    static const char *const keys[] = {"method", "pin", "device", "timeoutMs", "allowApChannelChange"};
    static const char *const methods[] = {"pbc", "pin"};
    *options = (wps_options_t){.config = {.wps_type = WPS_TYPE_PBC}, .timeout_ms = 120000};
    JSGCRef ref, device_ref;
    JSValue *field = JS_PushGCRef(ctx, &ref), *device = JS_PushGCRef(ctx, &device_ref);
    bool ok = false;
    if (!esp32_mquickjs_validate_plain_options(ctx, root->val, registrar ? "wifi.wps.startAP" : "wifi.wps.start", keys,
        sizeof(keys) / sizeof(keys[0]) - (registrar ? 1U : 0U))) goto done;
#define FIELD(name) do { *field = JS_GetPropertyStr(ctx, root->val, name); if (JS_IsException(*field)) goto done; } while (0)
    FIELD("method");
    if (!JS_IsUndefined(*field)) {
        size_t index;
        if (!esp32_mquickjs_value_to_enum(ctx, *field, methods, 2, &index)) goto invalid;
        options->config.wps_type = index ? WPS_TYPE_PIN : WPS_TYPE_PBC;
    }
    FIELD("pin");
    if (!JS_IsUndefined(*field)) {
        if (options->config.wps_type != WPS_TYPE_PIN ||
            !wps_string(ctx, *field, options->config.pin, sizeof(options->config.pin)) ||
            strlen(options->config.pin) != 8) goto invalid;
    }
    FIELD("timeoutMs");
    if (!JS_IsUndefined(*field) && !esp32_mquickjs_value_to_bounded_u32(ctx, *field, 1, 3600000, &options->timeout_ms)) goto invalid;
    *field = JS_UNDEFINED;
    if (!registrar) { FIELD("allowApChannelChange"); }
    if (!JS_IsUndefined(*field)) {
        if (!JS_IsBool(*field)) goto invalid;
        options->allow_ap_channel_change = *field == JS_TRUE;
    }
    FIELD("device"); *device = *field;
    if (!JS_IsUndefined(*device)) {
        static const char *const names[] = {"manufacturer", "modelNumber", "modelName", "deviceName"};
        wps_factory_information_t *f = &options->config.factory_info;
        char *outputs[] = {f->manufacturer, f->model_number, f->model_name, f->device_name};
        const size_t sizes[] = {sizeof(f->manufacturer), sizeof(f->model_number), sizeof(f->model_name), sizeof(f->device_name)};
        if (!esp32_mquickjs_validate_plain_options(ctx, *device, "wifi.wps.start device", names, 4)) goto done;
        for (unsigned i = 0; i < 4; ++i) {
            *field = JS_GetPropertyStr(ctx, *device, names[i]);
            if (JS_IsException(*field)) goto done;
            if (!JS_IsUndefined(*field) && !wps_string(ctx, *field, outputs[i], sizes[i])) goto invalid;
        }
    }
    if (!esp32_mquickjs_wifi_wps_config_valid(&options->config)) goto invalid;
    ok = true; goto done;
invalid:
    if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "invalid WPS options");
done:
    if (!ok) esp32_mquickjs_wireless_secure_zero(options, sizeof(*options));
    JS_PopGCRef(ctx, &device_ref); JS_PopGCRef(ctx, &ref); return ok;
#undef FIELD
}

static bool wps_options(JSContext *ctx, JSGCRef *root, wps_options_t *options)
{
    return wps_options_for_role(ctx, root, options, false);
}
#if CONFIG_ESP_WIFI_WPS_SOFTAP_REGISTRAR
bool esp32_mquickjs_wifi_wps_ap_capture_options(JSContext *ctx, JSGCRef *root,
    esp_wps_config_t *config, uint32_t *timeout_ms)
{
    wps_options_t options;
    bool ok = wps_options_for_role(ctx, root, &options, true);
    if (ok) { *config = options.config; *timeout_ms = options.timeout_ms; }
    esp32_mquickjs_wireless_secure_zero(&options, sizeof(options));
    return ok;
}
#endif

static esp32_mquickjs_wifi_wps_session_t *wps_receiver(JSContext *ctx, JSValue value)
{
    if (JS_GetClassID(ctx, value) != JS_CLASS_WIFI_WPS_SESSION) {
        JS_ThrowTypeError(ctx, "expected WiFiWpsSession"); return NULL;
    }
    esp32_mquickjs_wifi_wps_session_t *session = JS_GetOpaque(ctx, value);
    if (!session) JS_ThrowReferenceError(ctx, "invalid WiFiWpsSession");
    return session;
}
void js_wifi_wps_finalizer(JSContext *ctx, void *opaque)
{
    (void)ctx;
    /* Pending Future references keep the session alive. The registry requests
     * close when the final external reference, including those Futures, drops. */
    esp32_mquickjs_wifi_wps_session_release(opaque);
}
JSValue js_wifi_wps_constructor(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)self; (void)argc; (void)argv;
    return JS_ThrowTypeError(ctx, "use wifi.wps.start()");
}
static JSValue wps_identity(JSContext *ctx, uint64_t identity)
{
    if (!identity) return JS_NULL;
    JSGCRef ref;
    JSValue *value = JS_PushGCRef(ctx, &ref);
    *value = JS_NewObject(ctx);
    if (JS_IsException(*value)) goto fail;
    SET(value, "low", JS_NewUint32(ctx, (uint32_t)identity));
    SET(value, "high", JS_NewUint32(ctx, (uint32_t)(identity >> 32)));
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}
static JSValue wps_status_to_js(JSContext *ctx, const esp32_mquickjs_wifi_wps_session_status_t *s)
{
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "state", JS_NewString(ctx, s->closing ? s->retired ? "closed" : "closing" :
        s->error ? "faulted" : s->credentials_consumed ? "consumed" : s->credentials_ready ? "credentials-ready" :
        s->pin_ready ? "pin-ready" : s->native.worker.native.started ? "negotiating" : "opening"));
    SET(result, "operation", s->native.operation.identity ? JS_NewUint32(ctx, s->native.operation.identity) : JS_NULL);
    SET(result, "radioGeneration", s->native.operation.identity ? JS_NewUint32(ctx, s->native.operation.generation) : JS_NULL);
    SET(result, "nativeIdentity", wps_identity(ctx, s->native.worker.native.identity));
    SET(result, "workerBusy", JS_NewBool(s->worker_busy));
    SET(result, "driverStarted", JS_NewBool(s->native.worker.native.started));
    SET(result, "terminalSeen", JS_NewBool(s->native.worker.native.terminal_seen));
    SET(result, "pinReady", JS_NewBool(s->pin_ready && !s->closing && !s->pin_consumed));
    SET(result, "pinConsumed", JS_NewBool(s->pin_consumed));
    SET(result, "credentialsReady", JS_NewBool(s->credentials_ready && !s->closing && !s->credentials_consumed));
    SET(result, "credentialsConsumed", JS_NewBool(s->credentials_consumed));
    SET(result, "captureFinished", JS_NewBool(s->capture_finished));
    SET(result, "nativeClosed", JS_NewBool(s->native_closed));
    SET(result, "helperDrained", JS_NewBool(s->helper_drained));
    SET(result, "configRestored", JS_NewBool(s->native.config_restored));
    SET(result, "channelRestored", JS_NewBool(s->native.channel_restored));
    SET(result, "storageRestored", JS_NewBool(s->native.storage_restored));
    SET(result, "eventFenced", JS_NewBool(s->native.event_fenced));
    SET(result, "closeRequested", JS_NewBool(s->closing));
    SET(result, "cleanupPending", JS_NewBool(s->closing && !s->retired));
    SET(result, "timedOut", JS_NewBool(s->timed_out));
    SET(result, "handoffUnknown", JS_NewBool(s->native.worker.handoff_unknown));
    SET(result, "trackingFault", JS_NewBool(s->native.worker.native.tracking_fault));
    SET(result, "eventId", JS_NewInt32(ctx, s->native.worker.native.event_id));
    SET(result, "failureReason", JS_NewInt32(ctx, s->native.worker.native.failure_reason));
    SET(result, "nativeErrorStage", JS_NewInt32(ctx, s->native.worker.native.error_stage));
    SET(result, "nativeCleanupStage", JS_NewInt32(ctx, s->native.worker.native.cleanup_stage));
    SET(result, "reservedBytes", JS_NewUint32(ctx, s->reserved_bytes));
    SET(result, "error", s->error ? JS_NewInt32(ctx, s->error) : JS_NULL);
    SET(result, "stage", s->stage ? JS_NewString(ctx, s->stage) : JS_NULL);
    SET(result, "cleanupError", s->cleanup_error ? JS_NewInt32(ctx, s->cleanup_error) : JS_NULL);
    SET(result, "cleanupStage", s->cleanup_stage ? JS_NewString(ctx, s->cleanup_stage) : JS_NULL);
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}
#define WPS_WATCH_HANDLES 4U
#define WPS_WATCH_CAPACITY 16U
typedef struct {
    uint32_t sequence;
    esp32_mquickjs_wifi_wps_session_status_t status;
} wps_watch_event_t;
